In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [2]:
DataFrameObj = DataFrame(np.random.rand(36).reshape(6,6))

In [3]:
DataFrameObj

          0         1         2         3         4         5
0  0.905257  0.829574  0.116305  0.247283  0.999270  0.439277
1  0.759494  0.342299  0.906826  0.631980  0.984348  0.980145
2  0.723207  0.744810  0.769709  0.727674  0.916279  0.852987
3  0.807664  0.653522  0.266660  0.758598  0.926653  0.110342
4  0.510889  0.224309  0.893161  0.957188  0.722370  0.200752
5  0.455351  0.224211  0.152076  0.283291  0.447192  0.803180

In [4]:
DataFrameObj = DataFrameObj*100

In [5]:
DataFrameObj

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955  98.434799  98.014453
2  72.320669  74.481041  76.970893  72.767450  91.627904  85.298721
3  80.766446  65.352201  26.665951  75.859830  92.665286  11.034179
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [6]:
missing = np.nan #Not available. NaN. Basically a way to represent missing values 
missing

nan

In [7]:
DataFrameObj.ix[1:3,4:5] = missing
DataFrameObj

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955        NaN        NaN
2  72.320669  74.481041  76.970893  72.767450        NaN        NaN
3  80.766446  65.352201  26.665951  75.859830        NaN        NaN
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [8]:
DataFrameObj.isnull() #returns "logical" series/dataframe and all NaNs are true.

       0      1      2      3      4      5
0  False  False  False  False  False  False
1  False  False  False  False   True   True
2  False  False  False  False   True   True
3  False  False  False  False   True   True
4  False  False  False  False  False  False
5  False  False  False  False  False  False

In [9]:
DataFrameObj

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955        NaN        NaN
2  72.320669  74.481041  76.970893  72.767450        NaN        NaN
3  80.766446  65.352201  26.665951  75.859830        NaN        NaN
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [10]:
DFcpy = DataFrameObj
DFcpy

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955        NaN        NaN
2  72.320669  74.481041  76.970893  72.767450        NaN        NaN
3  80.766446  65.352201  26.665951  75.859830        NaN        NaN
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [18]:
DFcpy.fillna(0)

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955   0.000000   0.000000
2  72.320669  74.481041  76.970893  72.767450   0.000000   0.000000
3  80.766446  65.352201  26.665951  75.859830   0.000000   0.000000
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [19]:
DFfilled = DFcpy.fillna(0)
DFfilled

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955   0.000000   0.000000
2  72.320669  74.481041  76.970893  72.767450   0.000000   0.000000
3  80.766446  65.352201  26.665951  75.859830   0.000000   0.000000
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [20]:
# a dict can also be passed into .fillna(). Default is column wise
DFdictfilled = DFcpy.fillna({4:10,5:20})
DFdictfilled

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955  10.000000  20.000000
2  72.320669  74.481041  76.970893  72.767450  10.000000  20.000000
3  80.766446  65.352201  26.665951  75.859830  10.000000  20.000000
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [22]:
# method='ffill' will copy last non-null element in the column series into the null values
DFdictfilled = DFcpy.fillna(method="ffill")
DFdictfilled

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955  99.927013  43.927694
2  72.320669  74.481041  76.970893  72.767450  99.927013  43.927694
3  80.766446  65.352201  26.665951  75.859830  99.927013  43.927694
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [24]:
# counting is done using the .sum() values. it is done on logical dataframes
# and sums up all the true values. it is done for each column.

DFmissing = DataFrameObj
DFmissing

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
1  75.949421  34.229915  90.682621  63.197955        NaN        NaN
2  72.320669  74.481041  76.970893  72.767450        NaN        NaN
3  80.766446  65.352201  26.665951  75.859830        NaN        NaN
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [25]:
DFmissing.isnull().sum()

0    0
1    0
2    0
3    0
4    3
5    3
dtype: int64

In [26]:
#rows with missing values can be dropped by using drop na.
DFdropmissing = DFmissing
DFdropmissing=DFdropmissing.dropna()
DFdropmissing

           0          1          2          3          4          5
0  90.525692  82.957432  11.630547  24.728280  99.927013  43.927694
4  51.088940  22.430900  89.316091  95.718789  72.236976  20.075192
5  45.535071  22.421051  15.207639  28.329114  44.719153  80.318001

In [27]:
DFdropmissing = DFmissing
DFdropmissing = DFdropmissing.dropna(axis=1) #drops columns instead of rows
DFdropmissing

           0          1          2          3
0  90.525692  82.957432  11.630547  24.728280
1  75.949421  34.229915  90.682621  63.197955
2  72.320669  74.481041  76.970893  72.767450
3  80.766446  65.352201  26.665951  75.859830
4  51.088940  22.430900  89.316091  95.718789
5  45.535071  22.421051  15.207639  28.329114

In [ ]:
# .dropna(how="all") will delete a row only when there are all NaNs
# can use axis for columns
DFdropmissing = DFmissing
DFdropmissing = DFdropmissing.dropna(how="all") #drops columns instead of rows
DFdropmissing